Tekla Open API Reference for Tekla Structures 2025
Events.SelectionChange Event
 The SelectionChange event is raised when the selection is changed in a Tekla Structures drawing.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.SelectionChangeDelegate SelectionChange
Public Event SelectionChange As Events.SelectionChangeDelegate
Value
Type: Tekla.Structures.Drawing.UI.Events.SelectionChangeDelegate
Implements
IUIEvents.SelectionChange
See Also
Reference
Events Class
Tekla.Structures.Drawing.UI Namespace